marios_specialty_foods/app/views/products/index.html.erb

SELECT "products".* FROM "products"
---
    <h2>Recently Updated Products</h2>
    <% @products.recent_products.each do |product| %>