marios_specialty_foods/app/views/products/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]
SELECT  1 AS one FROM "reviews" WHERE "reviews"."product_id" = $1 LIMIT $2  [["product_id", 1], ["LIMIT", 1]]
---

<% if @product.reviews.any? %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]
---

  <% @product.reviews.each do |review| %>