marios_specialty_foods/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "cost", "country_of_origin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["cost", 69], ["country_of_origin", "United States of America"], ["created_at", "2022-06-05 22:08:55.927426"], ["updated_at", "2022-06-05 22:08:55.927426"]]

  def update
    @product= Product.find(params[:id])
    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "Edited Product"], ["updated_at", "2022-06-05 23:20:42.245700"], ["id", 2]]