marios_specialty_foods/app/controllers/reviews_controller.rb

  def new
    @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @product = Product.find(params[:product_id])
    @review = @product.reviews.new(review_params)
    if @review.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "reviews" ("author", "content_body", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def show
      @product = Product.find(params[:product_id])
      @review = Review.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

    def edit
      @product = Product.find(params[:product_id])
      @review = Review.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]

    def update
      @review = Review.find(params[:id])
      if @review.update(review_params)
        redirect_to product_path(@review.product)
      else
        @product = Product.find(params[:product_id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "reviews" SET "content_body" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["content_body", "this has been edited."], ["updated_at", "2022-06-03 03:35:20.298754"], ["id", 19]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]