marios_specialty_foods/app/models/product.rb

SELECT  "products".* FROM "products" WHERE "products"."updated_at" IS NOT NULL ORDER BY updated_at ASC LIMIT $1  [["LIMIT", 3]]
---
  scope :recent_products, -> {(all.where.not(updated_at: nil)
  .order("updated_at DESC").last(3)
  )}